In [2]:
import pandas as pd

In [3]:
import numpy as np

Database-stype DataFrame Merges

In [6]:
df1=pd.DataFrame({'key':['b','b','a','c','a','a','b'], 'data1': range(7)})

In [7]:
df2=pd.DataFrame({'key':['a','b','d'],'data2':range(3)})

In [8]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [9]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [10]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [14]:
df3=pd.DataFrame({'lkey':['b','b','a','c','a','a','b'],'data1':range(7)})

In [12]:
df4=pd.DataFrame({'rkey':['a','b','d'],'data2':range(3)})

In [15]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [16]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [18]:
#Many-to-many merges
df1=pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})

In [19]:
df2=pd.DataFrame({'key':['a','b','a','b','d'],'data2':range(5)})

In [20]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [21]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [22]:
pd.merge(df1, df2, on='key',how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [23]:
pd.merge(df1,df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [24]:
left=pd.DataFrame({'key1':['foo','foo','bar'],
                  'key2':['one','two','one'],
                  'lval':[1,2,3]})

In [25]:
right=pd.DataFrame({'key1':['foo','foo','bar','bar'],
                   'key2':['one','one','one','two'],
                   'rval':[4,5,6,7]})

In [26]:
pd.merge(left, right, on=['key1','key2'],how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [27]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [28]:
pd.merge(left, right ,on='key1', suffixes=('_left','_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

Merging on Index

In [5]:
left1=pd.DataFrame({'key':['a','b','a','a','b','c'],
                'value':range(6)})

In [9]:
right1=pd.DataFrame({'group_val':[3.5,7]}, index=['a','b'])

In [7]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [11]:
right1

   group_val
a        3.5
b        7.0

In [12]:
pd.merge(left1, right1, left_on='key',right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [13]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [14]:
#Hierarchically-indexed data
lefth=pd.DataFrame({'key1':['Ohio','Ohio','Ohio','Nevada','Nevada'],
                   'key2':[2000, 20001, 2002,2001,2002],
                   'data':np.arange(5.)})

In [15]:
righth=pd.DataFrame(np.arange(12).reshape((6,2)),
                   index=[['Nevada','Nevada','Ohio','Ohio','Ohio','Ohio'],
                         [2001,2000,2000,2000,2001,2002]],
                   columns=['event1','event2'])

In [16]:
lefth

     key1   key2  data
0    Ohio   2000   0.0
1    Ohio  20001   1.0
2    Ohio   2002   2.0
3  Nevada   2001   3.0
4  Nevada   2002   4.0

In [17]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [18]:
pd.merge(lefth, righth, left_on=['key1','key2'],right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [19]:
pd.merge(lefth, righth, left_on=['key1','key2'],right_index=True, how='outer')

     key1   key2  data  event1  event2
0    Ohio   2000   0.0     4.0     5.0
0    Ohio   2000   0.0     6.0     7.0
1    Ohio  20001   1.0     NaN     NaN
2    Ohio   2002   2.0    10.0    11.0
3  Nevada   2001   3.0     0.0     1.0
4  Nevada   2002   4.0     NaN     NaN
4  Nevada   2000   NaN     2.0     3.0
4    Ohio   2001   NaN     8.0     9.0

In [20]:
#Using the indexes of both sides of the merge
left2=pd.DataFrame([[1,2],[3,4],[5,6]],index=['a','c','e'], columns=['Ohio','Nevada'])

In [21]:
right2=pd.DataFrame([[7,8],[9,10],[11,12],[13,14]],index=['b','c','d','e'],columns=['Missouri','Alabama'])

In [22]:
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [23]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [24]:
pd.merge(left2, right2, how='outer',left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [25]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [26]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [27]:
another=pd.DataFrame([[7,8],[9,10],[11,12],[16,17]], index=['a','c','e','f'],columns=['New York','Oregon'])

In [28]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2       NaN      NaN         7       8
c     3       4       9.0     10.0         9      10
e     5       6      13.0     14.0        11      12

In [29]:
left2.join([right2,another], how='outer')

/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:6369: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  verify_integrity=True)

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

Concatenating Along an Axis

In [31]:
arr=np.arange(12).reshape((3,4))

In [32]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [33]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [35]:
s1=pd.Series([0,1],index=['a','b'])

In [36]:
s2=pd.Series([2,3,4],index=['c','d','e'])

In [37]:
s3=pd.Series([5,6],index=['f','g'])

In [38]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [39]:
pd.concat([s1,s2,s3],axis=1)

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [40]:
s4=pd.concat([s1*5,s3])

In [41]:
pd.concat([s1,s4],axis=1)

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [43]:
pd.concat([s1,s4],axis=1,join='inner')

   0  1
a  0  0
b  1  5

In [44]:
pd.concat([s1,s4],axis=1, join_axes=[['a','c','b','e'
]])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  5.0
e  NaN  NaN

In [45]:
result=pd.concat([s1,s1,s3],keys=['one','two','three'])

In [46]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [47]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [48]:
pd.concat([s1,s2,s3],axis=1,keys=['one','two','three'])

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [49]:
df1=pd.DataFrame(np.arange(6).reshape(3,2),index=['a','b','c'],columns=['one','two'])

In [50]:
df2=pd.DataFrame(5+np.arange(4).reshape(2,2),index=['a','c'],columns=['three','four'])

In [51]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'])

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [53]:
pd.concat({'level1':df1, 'level2':df2},axis=1)

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [54]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'],names=['upper','lower'])

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [55]:
df1=pd.DataFrame(np.random.randn(3,4),columns=['a','b','c','d'])

In [56]:
df2=pd.DataFrame(np.random.randn(2,3),columns=['a','b','a'])

Combining Data with Overlap

In [60]:
a=pd.Series([np.nan, 2.5, np.nan,3.5,4.5,np.nan],index=['f','e','d','c','b','a'])

In [61]:
b=pd.Series(np.arange(len(a),dtype=np.float64),index=['f','e','d','c','b','a'])

In [62]:
b[-1]=np.nan

In [63]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [64]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [65]:
df1=pd.DataFrame({'a':[1,np.nan,5,np.nan],
                 'b':[np.nan,2,np.nan,6],
                 'c':range(2,18,4)})

In [66]:
df2=pd.DataFrame({'a':[5,4,np.nan,3,7],
                 'b':[np.nan,3,4,6,8]})

In [67]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

Reshaping and Pivoting

In [3]:
#Reshaping with Hierarchical Indexing

In [5]:
data=pd.DataFrame(np.arange(6).reshape((2,3)), index=pd.Index(['Ohio','Colorado'],name='state'),columns=pd.Index(['one','two','three'],name='number'))

In [7]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [8]:
result=data.stack()

In [9]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [10]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [11]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [12]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [14]:
s1=pd.Series([0,1,2,3],index=['a','b','c','d'])

In [15]:
s2=pd.Series([4,5,6],index=['c','d','e'])

In [16]:
data2=pd.concat([s1,s2],keys=['one','two'])

In [17]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [18]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [19]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [20]:
df=pd.DataFrame({'left':result,'right':result+5},columns=pd.Index(['left','right'],name='side'))

In [21]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [22]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [23]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

In [26]:
#Removing Duplicates

In [28]:
data=pd.DataFrame({'k1':['one']*3+['two']*4,
                  'k2':[1,1,2,3,3,4,4]})

In [29]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [30]:
data.duplicated

<bound method DataFrame.duplicated of     k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4>

In [31]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [32]:
data['v1']=range(7)

In [33]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [37]:
#Transforming Data Using a Function or Mapping

In [39]:
data=pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','Pastrami','honey ham','nova lox'],
                  'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [40]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     Pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [41]:
meat_to_animal={'bacon':'pig','pulled port':'pig','pastrami':'cow','corned beef':'cow','honey ham':'chicken','nova lox':'salmon'}

In [42]:
data['animal']=data['food'].map(str.lower).map(meat_to_animal)

In [43]:
data

          food  ounces   animal
0        bacon     4.0      pig
1  pulled pork     3.0      NaN
2        bacon    12.0      pig
3     Pastrami     6.0      cow
4  corned beef     7.5      cow
5        Bacon     8.0      pig
6     Pastrami     3.0      cow
7    honey ham     5.0  chicken
8     nova lox     6.0   salmon

In [44]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

KeyError: 'pulled pork'

In [45]:
#Replacing Values

In [46]:
data=pd.Series([1,-999,2,-999,-1000,3])

In [47]:
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [48]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [49]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [50]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [52]:
#Renaming Axis Indexes

In [53]:
data=pd.DataFrame(np.arange(12).reshape((3,4)),index=['Ohio','Colorado','New York'],columns=['one','two','three','four'])

In [54]:
data.index.map(str.upper)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [55]:
data.index=data.index.map(str.upper)

In [56]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [57]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [58]:
data.rename(index={'ohio':'indiana'},columns={'three','peekaboo'})

TypeError: 'set' object is not callable

In [4]:
#Discretization and Binning

In [5]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]

In [6]:
bins=[18,25,35,60,100]

In [7]:
cats=pd.cut(ages,bins)

In [8]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [9]:
cats.labels

AttributeError: 'Categorical' object has no attribute 'labels'

In [10]:
cats.levels

AttributeError: 'Categorical' object has no attribute 'levels'

In [11]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [12]:
pd.cut(ages, [18,26,36,61,100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [13]:
group_names=['youth','YoungAdult','MiddleAged','Senior']

In [14]:
pd.cut(ages, bins, labels=group_names)

[youth, youth, youth, YoungAdult, youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [youth < YoungAdult < MiddleAged < Senior]

In [15]:
data=np.random.rand(20)

In [16]:
pd.cut(data,4,precision=2)

[(0.27, 0.51], (0.032, 0.27], (0.032, 0.27], (0.27, 0.51], (0.032, 0.27], ..., (0.75, 0.99], (0.27, 0.51], (0.51, 0.75], (0.032, 0.27], (0.75, 0.99]]
Length: 20
Categories (4, interval[float64]): [(0.032, 0.27] < (0.27, 0.51] < (0.51, 0.75] < (0.75, 0.99]]

In [17]:
#qcut: bins the data based on sample quantiles

In [18]:
data=np.random.randn(1000)

In [19]:
cats=pd.qcut(data,4)

In [20]:
cats

[(-0.0337, 0.67], (-3.4379999999999997, -0.703], (-3.4379999999999997, -0.703], (-3.4379999999999997, -0.703], (-0.0337, 0.67], ..., (-0.703, -0.0337], (-3.4379999999999997, -0.703], (0.67, 2.968], (0.67, 2.968], (-0.703, -0.0337]]
Length: 1000
Categories (4, interval[float64]): [(-3.4379999999999997, -0.703] < (-0.703, -0.0337] < (-0.0337, 0.67] < (0.67, 2.968]]

In [21]:
pd.value_counts(cats)

(0.67, 2.968]                    250
(-0.0337, 0.67]                  250
(-0.703, -0.0337]                250
(-3.4379999999999997, -0.703]    250
dtype: int64

In [22]:
pd.qcut(data,[0,0.1,0.5,0.9,1])

[(-0.0337, 1.249], (-1.304, -0.0337], (-1.304, -0.0337], (-1.304, -0.0337], (-0.0337, 1.249], ..., (-1.304, -0.0337], (-1.304, -0.0337], (-0.0337, 1.249], (1.249, 2.968], (-1.304, -0.0337]]
Length: 1000
Categories (4, interval[float64]): [(-3.4379999999999997, -1.304] < (-1.304, -0.0337] < (-0.0337, 1.249] < (1.249, 2.968]]

In [23]:
#Detecting and Filtering OUtliers

In [24]:
np.random.seed(12345)

In [25]:
data=pd.DataFrame(np.random.randn(1000,4))

In [26]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [27]:
col=data[3]

In [28]:
col[np.abs(col)>3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

In [29]:
#Select all rows having a value exceeding 3 or -3
data[(np.abs(data)>3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

In [30]:
data[np.abs(data)>3]=np.sign(data)*3

In [31]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

In [32]:
#Permutation and Random Sampling

In [33]:
df=pd.DataFrame(np.arange(5*4).reshape(5,4))

In [34]:
sampler=np.random.permutation(5)

In [35]:
sampler

array([1, 0, 2, 3, 4])

In [36]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [37]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [38]:
df.take(np.random.permutation(len(df))[:3])

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19

In [39]:
bag=np.array([5,7,-1,6,4])

In [40]:
sampler=np.random.randint(0, len(bag),size=10)

In [41]:
sampler

array([4, 4, 2, 2, 2, 0, 3, 0, 4, 1])

In [42]:
draws=bag.take(sampler)

In [43]:
draws

array([ 4,  4, -1, -1, -1,  5,  6,  5,  4,  7])

In [44]:
#Computing Indicator/Dummy Variables
df=pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})

In [45]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [46]:
dummies=pd.get_dummies(df['key'],prefix='key')

In [47]:
df_with_dummy=df[['data1']].join(dummies)

In [48]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [49]:
mnames=['movie_id','title','genres']

In [50]:
#String Object Methods

In [51]:
val='a,b,guido'

In [52]:
val.split(',')

['a', 'b', 'guido']

In [53]:
pieces=[x.strip() for x in val.split(',')]

In [54]:
pieces

['a', 'b', 'guido']

In [55]:
first, second, third=pieces

In [56]:
first+'::'+second+'::'+third

'a::b::guido'

In [57]:
'::'.join(pieces)

'a::b::guido'

In [58]:
'guido' in val

True

In [59]:
val.index(',')

1

In [60]:
val.find(':')

-1

In [61]:
val.count(',')

2

In [62]:
val.replace(',','::')

'a::b::guido'

In [63]:
val.replace(',','')

'abguido'

In [64]:
#Vectorized string functions in pandas

In [65]:
data={'Dave':'dave@google.com','Steve':'steve@gmail.com','Rob':'rob@gmail.com','Wes':np.nan}

In [66]:
data=pd.Series(data)

In [67]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [68]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

NameError: name 'pattern' is not defined